linux/paperwork/exam-outline.tex
% Created 2021-12-02 Thu 12:09
% Intended LaTeX compiler: pdflatex
\documentclass{wx672ctexart} \usepackage{wx672hyperref}
\usepackage{amsmath,amsfonts,amssymb}
\usepackage{graphicx}
\usepackage{tabularray}
\pagestyle{plain}
\author{王晓林}
\date{2021-12-02 Thu}
\title{《Linux应用》考核大纲}
\hypersetup{
 pdfauthor={王晓林},
 pdftitle={《Linux应用》考核大纲},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.1 (Org mode 9.4.6)}, 
 pdflang={Cn}}
\begin{document}

\maketitle
\tableofcontents

\clearpage

\begin{itemize}
\item 课程编号：50001198
\item 课程名称：Linux应用基础
\item 任课教师：王晓林
\item 适应专业：电信、信计、计算机等本科专业
\item 授课学时：32
\item 考试方式：闭卷机试
\item 命题规则：按《西南林业大学考试命题规则》(试行)(1996年10月修订)执行
\item 考试时间：120分钟
\item 推荐教材：《Advanced Bash Scripting Guide》
\item 课程性质及教学目的：本课为通信和计算机专业的选修课。 通过学习，要求学生全面了解Linux系统的工作环境，学会在Linux下完成日常工作和开发工作。
\end{itemize}

各章节考核目标如下：
\section{GNU/Linux简介}
\label{sec:org5b843dd}
\subsection{考核知识点}
\label{sec:org477c304}
\begin{itemize}
\item UNIX, GNU, Linux的起源、创始人
\item 开源软件
\end{itemize}
\subsection{考核要求}
\label{sec:org6feb019}
\begin{itemize}
\item 了解UNIX, GNU, Linux的基本历史常识
\item 了解开源软件
\end{itemize}
\section{Shell基础}
\label{sec:org765a270}
\subsection{考核知识点}
\label{sec:org35598ca}
\begin{itemize}
\item UNIX文件系统基本结构
\item 路径、目录、特殊文件
\item 常用的命令行命令
\item Shell编程
\end{itemize}
\subsection{考核要求}
\label{sec:org11dc8a9}
\begin{itemize}
\item 理解UNIX文件系统目录结构
\item 熟悉常用命令：ls, cd, pwd, cp, rm, man, help, ln, cat, less, mkdir\ldots{}
\item 会编写简单的Bash程序
\item 能看懂复杂的Bash程序
\end{itemize}
\section{常用软件工具}
\label{sec:orga220e59}
\subsection{考核知识点}
\label{sec:orgfa57e1d}
\begin{itemize}
\item 编辑器: emacs, vim
\item 网络工具: ping, ip, dhclient, ssh, scp, rsync, aria2c, nc, \ldots{}
\end{itemize}
\subsection{考核要求}
\label{sec:orgca9cda3}
\begin{itemize}
\item 能熟练使用emacs和vim
\end{itemize}
\section{软件开发环境}
\label{sec:orgf240e21}
\subsection{考核知识点}
\label{sec:org0dce9ee}
\begin{itemize}
\item GCC
\item make
\item gdb
\end{itemize}
\subsection{考核要求}
\label{sec:org8a181b3}
\begin{itemize}
\item 了解GCC, Makefile, GDB的使用
\end{itemize}
\section{Debian GNU/Linux系统管理}
\label{sec:orgc077dd4}
\subsection{考核知识点}
\label{sec:orgd359419}
\begin{itemize}
\item 最小系统的安装
\item apt
\item Debian 管理工具
\end{itemize}
\subsection{考核要求}
\label{sec:org7ecdc15}
\begin{itemize}
\item 会安装系统
\item 会安装、卸载软件
\item 会更新系统和软件
\end{itemize}
\end{document}
%%% Local Variables:
%%% mode: latex
%%% TeX-master: t
%%% End:
